Revit 2024 API
GenericForm Class
Provides access to the Generic Form model in Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class GenericForm : CombinableElement
Visual Basic
Public Class GenericForm _
	Inherits CombinableElement
Visual C++
public ref class GenericForm : public CombinableElement
Remarks
The Generic Form object can be queried for a generic form for use in family modeling and massing. It is the base class of Sweep, Blend, Extrusion, Revolution.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 Autodesk.Revit.DB.Blend
 Autodesk.Revit.DB.Extrusion
 Autodesk.Revit.DB.Form
 Autodesk.Revit.DB.FreeFormElement
 Autodesk.Revit.DB.Revolution
 Autodesk.Revit.DB.Sweep
 Autodesk.Revit.DB.SweptBlend
See Also
GenericForm Members
Autodesk.Revit.DB Namespace